### Step-by-step procedure
+ https://python.plainenglish.io/how-to-import-a-csv-file-into-a-mysql-database-using-python-script-791b051c5c33

<center><h1> Connect MySQL using Python</h1></center>

### Step 1. Connect to the MySQL 
#### Prerequisites
+ Python 3.x (installed)
+ MySQL workbench (installed)
+ mysql connectors (mysql-connector-python, pymysql, SQLalchemy)
+ I am a MacOS user

> We will see three different ways to connect MySQL using three different connectors: **mysql-connector-python**, **pymysql** and **SQLalchemy**.

In [1]:
## install mysql connectors

# # pymysql
# !pip install pymysql

# # mysql-connector-python
# !pip install mysql-connector-python

# # SQLalchemy
# !pip install sqlalchemy

# !pip install mysql.connector # this package doesn't work for me. Stackoverflow says this package is outdated

> Now we create a connection object to connect to MySQL/server. The **connect()** constructor creates a connection to the MySQL/server and returns a MySQLConnection object **conn** which will look like this: 
+ **<pymysql.connections.Connection at 0x7fd571e8ff10>** 
+ or **<mysql.connector.connection.MySQLConnection at 0x7fd548031220>**

In [2]:
#  Create MySQL connection using mysql-connector-python package

import mysql.connector
conn = mysql.connector.connect(
    host='localhost', 
    user='root', 
    password='Skior.638'
)


# # Create MySQL connection using pymysql package

# import pymysql
# conn =  pymysql.connect(
#     host='localhost', 
#     user='root', 
#     password='Skior.638'
# )

In [3]:
# Check if the connection object (similar to engine) has been created
conn

In [4]:
# # To check what are the methods and attributes in pymysql
# dir(mysql.connector)

# # To check what are the methods and attributes in pymysql
# dir(pymysql)

Cursor is a Temporary Memory or Temporary Work Station. It is Allocated by Database Server at the Time of Performing DML(Data Manipulation Language) operations on Table by User. Cursors are used to store Database Tables.

In [5]:
#Create the cursor
my_cursor = conn.cursor()

In [6]:
my_cursor

### Step 2: Create a database (To create a new database; else skip this part)
+ **execute()** method is used to execute any sql query for both the connection objects from both packages

In [7]:
#Creating a database using cursor object and execute it
my_cursor.execute("DROP DATABASE IF EXISTS pythonDB")
my_cursor.execute("CREATE DATABASE pythonDB")

In [8]:
# Check the database; loop the cursor object to get all the databases
my_cursor.execute("SHOW DATABASES")
for i in my_cursor:
    print(i)

('Coursera',)
('IBM',)
('information_schema',)
('mysql',)
('performance_schema',)
('pythonDB',)
('sys',)

## Step 2a: Optional
#### The connection object can be done in a better way with error handling technique

In [9]:
import mysql.connector as msql
from mysql.connector import Error
try:
    conn = msql.connect(host='localhost', user='root',  
                        password='Skior.638')
    if conn.is_connected():
        my_cursor = conn.cursor()
        my_cursor.execute("DROP DATABASE IF EXISTS pythonDB")
        my_cursor.execute("CREATE DATABASE pythonDB")
        print("phthonDB database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

phthonDB database is created

## Step 3. Select the database (USE DATABASE database_name)

Once we have created a database or we have an existing database (pythondb), in both cases we have to create a **new connection object** to connect with MySQL/server because **the previous connection doesn't have database information (database connection).**

In [10]:
# Create database connection using pymysql package

import pymysql
con_db = pymysql.connect(
    host='localhost', 
    user='root', 
    password='S0umen.809',
    database = "pythonDB"
)
con_db


#Create database connection usingmysql-connector-python package

# import mysql.connector
# con_db= mysql.connector.connect(
#     host='localhost', 
#     user='root', 
#     password='S0umen.809',
#     database = "pythonDB"
# )
# con_db

In [11]:
# dir(con_db)

In [12]:
#Create the new cursor
my_cursor = con_db.cursor()

##### SQLalchemy 
+ Pysheet: https://www.pythonsheets.com/notes/python-sqlalchemy.html
+ https://github.com/crazyguitar/pysheeet
> You can connect SQL database uning **SQLalchemy** package too but *I don't know how to create a database using SQLalchemy* 

+ **engine** object is same as **my_cursor** object
+ https://docs.sqlalchemy.org/en/14/orm/tutorial.html

In [13]:
import sqlalchemy

db_url = "mysql+pymysql://{user}:{pw}@localhost/{db}".format(user = 'root', pw = 'Skior.638', db = 'pythondb')
engine = sqlalchemy.create_engine(db_url)

## Step 4. Create a new table
+ Create a new table (INSTRUCTOR) in the database pythonDB

In [14]:
# Drop if the table (INSTRUCTOR) is already exist

my_cursor.execute("DROP TABLE IF EXISTS INSTRUCTOR")

# engine.execute("DROP TABLE IF EXISTS INSTRUCTOR")

0

In [15]:
#Create a new table

my_cursor.execute("CREATE TABLE INSTRUCTOR(\
                ID INTEGER PRIMARY KEY NOT NULL,\
                FNAME VARCHAR (30), \
                LNAME VARCHAR (30),\
                CITY VARCHAR (15),\
                CCODE CHAR(3)) "
                )

# engine.execute("CREATE TABLE INSTRUCTOR(\
#                 ID INTEGER PRIMARY KEY NOT NULL,\
#                 FNAME VARCHAR (30), \
#                 LNAME VARCHAR (30),\
#                 CITY VARCHAR (15),\
#                 CCODE CHAR(3)) "
#                 )

0

In [16]:
# Show Tables or Database

result = engine.execute("SHOW TABLES")

#result = engine.execute("SHOW DATABASES")

for i in result:
    print(i)

('INSTRUCTOR',)

## Step 5: Insert data into the table
Now we will insert data into the table INSTRUCTOR

In [17]:
# Insert data into the table

insertQuery = "INSERT INTO INSTRUCTOR VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')"
my_cursor.execute(insertQuery)

# engine.execute(insertQuery)

1

## Step 6: Retrieve data into the table
Now we will retrieve data from INSTRUCTOR table

In [18]:
selectQuery = "SELECT * FROM INSTRUCTOR"
my_cursor.execute(selectQuery) # the result set returns with in the my_cursor object

# result = engine.execute(selectQuery) # the result set returns by the engine is captured by result variable (object)

1

In [19]:
# dir(my_cursor)
#dir(result)

In [20]:
result = my_cursor.fetchall()# fetch all the records from the table
# result = my_cursor.fetchone() # to fetch one record only
for i in result:
    print(i)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')

## Step 6: Commit the transaction
+ **commit()** method sends a COMMIT statement to the MySQL server, committing the current transaction. After that you can check all the changes from MySQL workbench

>Since by default Connector/Python does not autocommit, it is important to **call this method after every transaction that modifies data for tables** that use transactional storage engines.

**SQLalchemy engine is autocommit**. No need to commit any transaction explicitly when you execute query by engine object.

In [21]:
con_db.commit()

## Step 8: Add more data into the table and fetch all
Now we will add more data from INSTRUCTOR table

In [22]:
# Insert two more data into the table

insertQuery2 = "INSERT INTO INSTRUCTOR VALUES (2, 'Raul', 'Chong', 'Markham', 'CA'), \
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')"

my_cursor.execute(insertQuery2)


# engine.execute(insertQuery2)

2

In [23]:
my_cursor.execute("SELECT * FROM INSTRUCTOR")
result = my_cursor.fetchall()

# result = engine.execute("SELECT * FROM INSTRUCTOR") 

for i in result:
    print(i)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [24]:
con_db.commit()

## Step 9: Update data into the table and fetch all
Now we will update the table that changes the Rav's CITY to KOLKATA and then check if it was updated by SELECT statement.

In [25]:
# Update data in INSTRUCTOR table
updateQuert = "UPDATE INSTRUCTOR SET CITY='KOLKATA' WHERE FNAME='Rav'"
my_cursor.execute(updateQuert)

# engine.execute(updateQuert)

1

In [26]:
my_cursor.execute("SELECT * FROM INSTRUCTOR")
result = my_cursor.fetchall()

# result = engine.execute("SELECT * FROM INSTRUCTOR") 

for i in result:
    print(i)

(1, 'Rav', 'Ahuja', 'KOLKATA', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [27]:
con_db.commit()

## Step 10: Close the connection
+ We should close the cursor and connection (objects) which will free the memory every time we finish working with the database

In [28]:
# check if the connection is still open
con_db.open

True

In [29]:
# Close the connection for pymysql    
if con_db.open:
    my_cursor.close()
    con_db.close()
    print("MySQL connection is closed")
    
    
    
# # Close the connection for mysql.connector
# if conn_update.is_connected():
#     my_cursor.close()
#     conn_update.close()
#     print("MySQL connection is closed")

MySQL connection is closed

In [30]:
#Check if the connection is still open
con_db.open

False

## Task 11: Retrieve data into Pandas

In this step we will retrieve the contents of the INSTRUCTOR table into a Pandas dataframe

###### Using mysql.connector and pymysql

In [31]:
import pandas as pd

# Create database connection using mysql.connector
import mysql.connector
pd_con = mysql.connector.connect(
    host='localhost', 
    user='root', 
    password='Skior.638',
    database = "pythonDB"
)

pd_con


# # Create database connection using pymysql
# import pymysql
# pd_con = pymysql.connect(
#     host='localhost', 
#     user='root', 
#     password='Skior.638',
#     database = "pythonDB"
# )

# pd_con

In [32]:
my_cursor = pd_con.cursor()

In [33]:
df = pd.read_sql('SELECT * FROM INSTRUCTOR', pd_con)

In [34]:
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  KOLKATA    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

In [35]:
df.LNAME[0]

'Ahuja'

In [36]:
df.shape

(3, 5)

In [38]:
# Close the connection for mysql.connector
if pd_con.is_connected():
    my_cursor.close()
    pd_con.close()
    print("MySQL connection is closed")
    
    
# # Close the connection for pymysql    
# if pdconn.open:
#     my_cursor.close()
#     pdconn.close()
#     print("MySQL connection is closed")

MySQL connection is closed

###### Using AQLalchemy

In [39]:
import pandas as pd

# Create database connection using sqlalchemy

import sqlalchemy

db_url = "mysql+pymysql://{user}:{pw}@localhost/{db}".format(user = 'root', pw = 'Skior.638', db = 'pythondb')
engine = sqlalchemy.create_engine(db_url)

engine

Engine(mysql+pymysql://root:***@localhost/pythondb)

In [40]:
df = pd.read_sql("SELECT * FROM INSTRUCTOR", engine)

In [41]:
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  KOLKATA    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

<center><h1>Import & create a table from CSV file (directly) into the MySQL database using python</h1></center>

### STEP 1: Create connection with the database

+ #### This time, we’ll use the module *sqlalchemy* to create our connection and the *to_sql()* function of pandas to insert our data.

+ 
 #### Engine Vonfiguration <a href="https://docs.sqlalchemy.org/en/12/core/engines.html">Link to sqlalchemy documentation</a>
 <img src="files/Engine Config.png" width="800" height="400">

In [ ]:
!pip install sqlalchemy

In [42]:
import sqlalchemy

db_url = "mysql+pymysql://{user}:{pw}@localhost/{db}".format(user="root", pw="Skior.638", db="pythonDB")

# this is how you would connect in sqlalchemy
engine = sqlalchemy.create_engine(db_url)

engine

Engine(mysql+pymysql://root:***@localhost/pythonDB)

 ### Step 2. Inserting Pandas DataFrames directly  Into  a Databases Using INSERT

In [43]:
import pandas as pd

path = "/Users/skior/Documents/Study Materials/Coursera/SQL/" # location of the csv file

# Create a DataFrame from csv file
df = pd.read_csv(path + "Student.csv", index_col=False, delimiter = ',')


df.head()

,id,first_name,last_name,date_of_birth,ethnicity,gender,status,entry_academic_period,exclusion_type,act_composite,...,sat_reading,hs_gpa,hs_city,hs_state,hs_zip,email,entry_age,ged,english_2nd_language,first_generation
0,111111.0,John,Doe,01/2000,Hispanic,M,FT,Fall 2008,NaN,NaN,...,NaN,2.71,Albuquerque,New Mexico,87112.0,jdoe@example.com,17.9,False,False,True
1,111112.0,Jane,Smith,05/2001,Hispanic,F,TRANSFER,Fall 2006,NaN,NaN,...,NaN,3.73,New York,New York,10009.0,jsmith@example.com,18.1,False,False,True
2,111113.0,Sarah,Thomas,21/2002,Hispanic,M,FTFT,Fall 2006,NaN,14.0,...,NaN,2.64,Pheonix,Arizona,85006.0,sthomas@example.com,17.6,False,False,False
3,111114.0,Frank,Brown,13/2002,Race/ethnicity unknown,M,FTFT,Fall 2006,NaN,NaN,...,210.0,3.68,Pheonix,Arizona,85015.0,fbrown@example.com,19.0,True,False,True
4,111115.0,Mike,Davis,31/2001,White,F,FTFT,Fall 2007,NaN,22.0,...,NaN,3.46,Seattle,Washington,98106.0,mdavis@example.com,18.2,False,True,False

### STEP 3: Insert the entire dataFrame into the table

> I have use **SQLalchamy engine object** to insert data into table. 
+ Connection object (ie. pd_con) using mysql.connector or pymysql gives 
DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement
+ Because **con** is SQLAlchemy engine or DBAPI2 connection (legacy mode). Using SQLAlchemy makes it possible to use any DB supported by that library.

In [44]:
# Insert entire DataFrame into MySQL

df.to_sql('STUDENT', con = engine, if_exists = 'replace', index=False)

# if_exists = 'append' if you want to add data to the table

In [46]:
result = engine.execute("SELECT id, first_name, last_name, gender FROM STUDENT LIMIT 5")

In [47]:
# check the methods
# dir(result)

In [48]:
result.fetchall()

[(111111.0, 'John', 'Doe', 'M'),
 (111112.0, 'Jane', 'Smith', 'F'),
 (111113.0, 'Sarah', 'Thomas', 'M'),
 (111114.0, 'Frank', 'Brown', 'M'),
 (111115.0, 'Mike', 'Davis', 'F')]

In [49]:
#close the object
result.close()

###  STEP 4: Query the database to check your work
+ To do so **restart** the karnel and connect again with the database
+ Then we pull the data from database into dataFrame

> **Using SQLAlchemy and pandas**

In [50]:
import pandas as pd
import sqlalchemy 

#Database connection credentials
db_url = "mysql+pymysql://{user}:{password}@localhost/{db}".format(user="root",password="Skior.638",db="pythonDB")
                                                                   
# Create sqlalchemy engine (connection with database)
engine = sqlalchemy.create_engine(db_url)

engine

# df = pd.read_sql('DESCRIBE STUDENT', engine)

df = pd.read_sql("SELECT id,first_name, last_name, date_of_birth FROM STUDENT LIMIT 5", engine)

df

         id first_name last_name date_of_birth
0  111111.0       John       Doe       01/2000
1  111112.0       Jane     Smith       05/2001
2  111113.0      Sarah    Thomas       21/2002
3  111114.0      Frank     Brown       13/2002
4  111115.0       Mike     Davis       31/2001

In [51]:
# Shows all the tables in the pythionDB
engine.table_names()

/var/folders/48/wqbkl0yn7q53qgyxvlsf7md00000gn/T/ipykernel_8781/807037519.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['INSTRUCTOR', 'STUDENT']

> **Create a new table into MySQL database from the DataFrame**

In [52]:
# Create a new table into MySQL database from the DataFrame
df.to_sql('NEW_STUDENT', con = engine, if_exists = 'replace', index=False)

In [53]:
df1 = pd.read_sql("SELECT * FROM NEW_STUDENT", engine)

df1

         id first_name last_name date_of_birth
0  111111.0       John       Doe       01/2000
1  111112.0       Jane     Smith       05/2001
2  111113.0      Sarah    Thomas       21/2002
3  111114.0      Frank     Brown       13/2002
4  111115.0       Mike     Davis       31/2001

> **Using mysql.connector or pymysql**

In [54]:
import pandas as pd
import mysql.connector
db_con = mysql.connector.connect(
    host='localhost', 
    user='root', 
    password='S0umen.809',
    database = "pythonDB"
)

#Read Data query into a DataFrame
df_table = pd.read_sql('SHOW TABLES', db_con)
df = pd.read_sql("SELECT id, first_name, last_name, date_of_birth  FROM STUDENT",db_con)

df.head()

         id first_name last_name date_of_birth
0  111111.0       John       Doe       01/2000
1  111112.0       Jane     Smith       05/2001
2  111113.0      Sarah    Thomas       21/2002
3  111114.0      Frank     Brown       13/2002
4  111115.0       Mike     Davis       31/2001

> *Can not create a new table into MySQL database from the DataFrame because **con** is SQLAlchemy engine*